org/lrn/lisp/lisp-0.org
#+STARTUP: showall indent hidestars

* План работ

Начнем с реализации системы, которая позволит вычислять списковые формы.

Важнейшая часть интерпретатора Лисп - функция, называемая ~eval~, принимает на вход
список, представляющий собой программу, а на выходе возвращает результат её исполнения.

Так как мы пишем интерпретатор Lisp на лиспе, то наша функция будет называться
~myeval~.

Для того, чтобы писать минимально осмысленные, программмы мы должны реализовать базовый
набор примитивов (pure lisp):
- cons
- car
- cdr
- null
- consp
- define
- lambda
- functionp
- numberp
- eq
- сравнение чисел (=)
- if (или cond)

Имея функцию сравнения на равенстрво чисел и функции ~car~ и ~cdr~ можно определить
функцию, которая сравнивает списки, состоящие из чисел.  Поэтому база сранений - ~eq~
(сравнение символов) и ~=~.

В целях тренировки (на первом этапе) мы реализуем несколько отличающийся набор:
- вычисление самовычисляемых форм, таких как числа (и nil)
- арифметические вычисления: + (add) и * (mul)
- quote
- car
- cdr
- cons
- null
- if
- cond
- progn
- print
- list
- and
- or

Можно построить ~myeval~ с помощью ~cond~, тогда его структура будет такой:

#+BEGIN_SRC lisp
  (defun myeval (lst)
    (cond
      ;; Какие-то действия в зависимости от того какая форма
      ;; ...
      (t (error 'unknown-form))))
#+END_SRC

* Самовычисляемые формы

Первые случаи, которые мы можем реализовать - это самовычисляемые формы, такие,
например, как NIL, T и числа, которые вычисляются сами в себя:

#+NAME: number_0
#+BEGIN_SRC lisp
  ((null lst)                  nil)
  ((equal t lst)               t)
  ((numberp lst)               lst)
#+END_SRC

Протестируем

#+NAME: number_0_test
#+BEGIN_SRC lisp
  ;; Тесты для самовычисляемых форм
  (assert (equal T (myeval 'T)))
  (assert (equal NIL (myeval 'NIL)))
  (assert (equal 999 (myeval 999)))
#+END_SRC

* Встроенные функции арифметики

Теперь мы можем сделать функции сложения и умножения. Для того, чтобы они могли
принимать любое количество аргументов, необходимо сделать их рекурсивными.

Они будут получать список, брать из него первый элемент и оценивать его, а потом
рекурсивно вызывать себя от остатка списка.

#+NAME: evaddmul_0
#+BEGIN_SRC lisp
  (defun evadd (lst)
    (cond ((null lst)        (+))
          ((null (cdr lst))  (+ (myeval (car lst))))
          (t                 (+ (myeval (car lst))
                                (evadd (cdr lst))))))
  (defun evmul (lst)
    (cond ((null lst)        (*))
          ((null (cdr lst))  (* (myeval (car lst))))
          (t                 (* (myeval (car lst))
                                (evmul (cdr lst))))))
#+END_SRC

Протестируем ~evadd~ и ~evmul~:

#+NAME: evaddmul_0_test
#+BEGIN_SRC lisp
  ;; Тесты для EVADD и EVMUL
  (assert (equal (+ 1 2 3) (evadd '(1 2 3))))
  (assert (equal (* 1 2 3) (evadd '(1 2 3))))
#+END_SRC

Теперь мы можем определить сложение и умножение внутри ~myeval~

#+NAME: ariph_0
#+BEGIN_SRC lisp
  ((equal (car lst) '+)        (evadd (cdr lst)))
  ((equal (car lst) '*)        (evmul (cdr lst)))
#+END_SRC

Теперь мы можем протестировать то, что у нас получилось:

#+NAME: ariph_0_test
#+BEGIN_SRC lisp
  ;; Тесты для арифметических функций
  (assert (equal 7 (myeval 7)))
  (assert (equal 3 (myeval '(+ 1 2))))
  (assert (equal 21 (myeval '(* (+ 1 2) (+ 3 4)))))
#+END_SRC

* Цитирование

Следующая важная вещь - специальная форма QUOTE. Она возвращает свое содержимое без
вычисления:

#+NAME: quote_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'quote)    (cadr lst))
#+END_SRC

Протестируем её:

#+NAME: quote_0_test
#+BEGIN_SRC lisp
  ;; Тесты для QUOTE
  (assert (equal '(+ 1 2) (myeval '(quote (+ 1 2)))))
#+END_SRC

* Работа с CONS-ячейками

Теперь определим CAR и CDR:

#+NAME: car_cdr_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'car)      (car (myeval (cadr lst))))
  ((equal (car lst) 'cdr)      (cdr (myeval (cadr lst))))
#+END_SRC

Мы пока не можем протестировать их работу, потому что у нас нет CONS. Исправим это:

#+NAME: cons_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'cons)     (cons (myeval (cadr lst))
                                     (myeval (caddr lst))))
#+END_SRC

Теперь можно протестировать создание cons-ячеек и получение правой и левой части ячейки

#+NAME: car_cdr_cons_0_test
#+BEGIN_SRC lisp
  ;; Тесты для cons-ячеек
  (assert (equal '(1 . 2) (myeval '(cons 1 2))))
  (assert (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)))))
  (assert (equal 2 (myeval '(car (cons 2 3)))))
  (assert (equal 3 (myeval '(cdr (cons 2 3)))))
  (assert (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))))))
  (assert (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))))))
#+END_SRC

* NULL-предикат

Следующий этап - функция проверки на пустой список:

#+NAME: null_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'null)     (null (myeval (cadr lst))))
#+END_SRC

Тест

#+NAME: null_0_test
#+BEGIN_SRC lisp
  ;; Тесты для NULL
  (assert (equal T (myeval '(null ()))))
#+END_SRC

* Условное выполнение (IF)

Теперь мы можем создать IF. Он принимает три аргумента и в зависимости от результата
вычисления первого аргумента вычисляет второй или третий аргумент:

#+NAME: if_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'if)       (if (myeval (cadr lst))
                                   (myeval (caddr lst))
                                   (myeval (cadddr lst))))
#+END_SRC

Проверим, правильно ли вычисляется IF:

#+NAME: if_0_test
#+BEGIN_SRC lisp
  ;; Тесты для IF
  (assert (equal 2 (myeval '(if () 1 2))))
  (assert (equal 1 (myeval '(if (null ()) 1 2))))
#+END_SRC

