www/lrn/lisp/lisp-0.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">План работ</a></li>
<li><a href="#unnumbered-2">Самовычисляемые формы</a></li>
<li><a href="#unnumbered-3">Цитирование</a></li>
<li><a href="#unnumbered-4">Работа с CONS-ячейками</a></li>
<li><a href="#unnumbered-5">NULL-предикат</a></li>
<li><a href="#unnumbered-6">Условное выполнение (IF)</a></li>
<li><a href="#unnumbered-7">COND</a></li>
<li><a href="#unnumbered-8">PROGN</a></li>
<li><a href="#unnumbered-9">PRINT</a></li>
<li><a href="#unnumbered-10">LIST</a></li>
<li><a href="#unnumbered-11">AND</a></li>
<li><a href="#unnumbered-12">OR</a></li>
<li><a href="#unnumbered-13">Встроенные функции арифметики</a></li>
<li><a href="#unnumbered-14">Итоги</a></li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">План работ</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Начнем с реализации системы, которая позволит вычислять списковые формы.
</p>

<p>
Важнейшая часть интерпретатора Лисп - функция, называемая <code>eval</code>, принимает на вход
список, представляющий собой программу, а на выходе возвращает результат её исполнения.
</p>

<p>
Так как мы пишем интерпретатор Lisp на лиспе, то наша функция будет называться
<code>myeval</code>.
</p>

<p>
Для того, чтобы писать минимально осмысленные, программмы мы должны реализовать базовый
набор примитивов (pure lisp):
</p>
<ul class="org-ul">
<li>cons
</li>
<li>car
</li>
<li>cdr
</li>
<li>null
</li>
<li>consp
</li>
<li>define
</li>
<li>lambda
</li>
<li>functionp
</li>
<li>numberp
</li>
<li>eq
</li>
<li>сравнение чисел (=)
</li>
<li>if (или cond)
</li>
</ul>

<p>
Имея функцию сравнения на равенстрво чисел и функции <code>car</code> и <code>cdr</code> можно определить
функцию, которая сравнивает списки, состоящие из чисел.  Поэтому база сранений - <code>eq</code>
(сравнение символов) и <code>=</code>.
</p>

<p>
В целях тренировки (на первом этапе) мы реализуем несколько отличающийся набор:
</p>
<ul class="org-ul">
<li>вычисление самовычисляемых форм, таких как числа (и nil)
</li>
<li>арифметические вычисления: + (add) и * (mul)
</li>
<li>quote
</li>
<li>car
</li>
<li>cdr
</li>
<li>cons
</li>
<li>null
</li>
<li>if
</li>
<li>cond
</li>
<li>progn
</li>
<li>print
</li>
<li>list
</li>
<li>and
</li>
<li>or
</li>
</ul>

<p>
Можно построить <code>myeval</code> с помощью <code>cond</code>, тогда его структура будет такой:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (lst)
  (<span style="color: #af00ff;">cond</span>
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1050;&#1072;&#1082;&#1080;&#1077;-&#1090;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;</span>
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">...</span>
    (t (<span style="color: #ff0000; font-weight: bold;">error</span> 'unknown-form))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Самовычисляемые формы</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Первые случаи, которые мы можем реализовать - это самовычисляемые формы, такие,
например, как NIL, T и числа, которые вычисляются сами в себя:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="number_0">((null lst)                  nil)
((equal t lst)               t)
((numberp lst)               lst)
</pre>
</div>

<p>
Протестируем
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="number_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1072;&#1084;&#1086;&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval 'T)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval 'NIL)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 999 (myeval 999)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Цитирование</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
Следующая важная вещь - специальная форма QUOTE. Она возвращает свое содержимое без
вычисления:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="quote_0">((equal (car lst) 'quote)    (cadr lst))
</pre>
</div>

<p>
Протестируем её:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="quote_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; QUOTE</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(+ 1 2) (myeval '(quote (+ 1 2)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">Работа с CONS-ячейками</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<p>
Теперь определим CAR и CDR:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="car_cdr_0">((equal (car lst) 'car)      (car (myeval (cadr lst))))
((equal (car lst) 'cdr)      (cdr (myeval (cadr lst))))
</pre>
</div>

<p>
Мы пока не можем протестировать их работу, потому что у нас нет CONS. Исправим это:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="cons_0">((equal (car lst) 'cons)     (cons (myeval (cadr lst))
                                   (myeval (caddr lst))))
</pre>
</div>

<p>
Теперь можно протестировать создание cons-ячеек и получение правой и левой части ячейки
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="car_cdr_cons_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; cons-&#1103;&#1095;&#1077;&#1077;&#1082;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(cons 1 2))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(car (cons 2 3)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(cdr (cons 2 3)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-2">
<h2 id="unnumbered-5">NULL-предикат</h2>
<div class="outline-text-2" id="text-unnumbered-5">
<p>
Следующий этап - функция проверки на пустой список:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="null_0">((equal (car lst) 'null)     (null (myeval (cadr lst))))
</pre>
</div>

<p>
Тест
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="null_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; NULL</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null ()))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-2">
<h2 id="unnumbered-6">Условное выполнение (IF)</h2>
<div class="outline-text-2" id="text-unnumbered-6">
<p>
Теперь мы можем создать IF. Он принимает три аргумента и в зависимости от результата
вычисления первого аргумента вычисляет второй или третий аргумент:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="if_0">((equal (car lst) 'if)       (<span style="color: #af00ff;">if</span> (myeval (cadr lst))
                                 (myeval (caddr lst))
                                 (myeval (cadddr lst))))
</pre>
</div>

<p>
Проверим, правильно ли вычисляется IF:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="if_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; IF</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> () 1 2))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> (null ()) 1 2))))
</pre>
</div>
</div>
</div>
