org/lrn/lisp/lisp-0.org
* COND

Определив IF, мы можем заняться и более сложной управляющей формой - COND. Для ее
реализации потребуется вспомогательная функция, которая будет рекурсивно исполнять
аргументы COND. Назовем ее EVCOND:

#+NAME: evcond_0
#+BEGIN_SRC lisp
  (defun evcond (lst)
    (cond ((null lst)               nil)
          ((myeval (caar lst))      (myeval (cadar lst)))
          (t                        (evcond (cdr lst)))))
#+END_SRC

Она вычисляет левую часть первого из переданных clauses и если оценка вернула T - то
выполняет соответствующую правую часть и возвращается. В противном случае она
рекурсивно вызывает себя, передавая остаток списка clauses

Протестируем EVCOND:

#+NAME: evcond_0_test
#+BEGIN_SRC lisp
  ;; Тесты для ENVCOND
  (assert (equal 2 (evcond '((t 2) (t 1)))))
  (assert (equal 1 (evcond '((nil 2) (t 1)))))
  (assert (equal nil (evcond '((nil 2) (nil 1)))))
#+END_SRC

С использованием EVCOND определить COND довольно просто:

#+NAME: cond_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'cond)     (evcond (cdr lst)))
#+END_SRC

Протестируем правильность работы COND:

#+NAME: cond_0_test
#+BEGIN_SRC lisp
  ;; Тесты для COND
  (assert (equal 2 (myeval '(cond
                             (() 1)
                             (1 2)))))
#+END_SRC

* PROGN

Далее нам понадобится ~progn~. Снова будем использовать вспомогательную функцию ~evprogn~:

#+NAME: evprogn_0
#+BEGIN_SRC lisp
  (defun evprogn (lst)
    (cond ((null lst)        nil)
          ((null (cdr lst))  (myeval (car lst)))
          (t                 (myeval (car lst))
                             (evprogn (cdr lst)))))
#+END_SRC

Эта функция завершается с возвращением результата выполнения первого элемента
переданного списка, когда ей передан список из одного элемента. Иначе она вычисляет
первый элемент и рекурсивно вызывает себя от остатка списка.

Тест для ~evprogn~

#+NAME: evprogn_0_test
#+BEGIN_SRC lisp
  ;; Тест для EVPROGN
  (assert (equal 2 (evprogn '(1 2))))
#+END_SRC

с ее помощью определим PROGN:

#+NAME: progn_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'progn)    (evprogn (cdr lst)))
#+END_SRC

И проверим:

#+NAME: progn_0_test
#+BEGIN_SRC lisp
  ;; Тесты для PROGN
  (assert (equal 3 (myeval '(progn 1 2 3))))
#+END_SRC

* PRINT

Для того, чтобы иметь возможность отладочной печати, определим PRINT:

#+NAME: print_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'print)    (print (myeval (cadr lst))))
#+END_SRC

Чтобы протестировать ~print~ воспользуемся перехватом ~standatd-output~

#+NAME: print_0_test
#+BEGIN_SRC lisp
  ;; Тесты для PRINT
  (assert (equal (with-output-to-string (*standard-output*)
                   (print 12))
                 (with-output-to-string (*standard-output*)
                   (myeval '(print 12)))))
  (assert (equal (print 12)
                 (myeval '(print 12))))
#+END_SRC

* LIST

List - это функция, которая вычисляет свои аргументы и формирует из результатов
вычисления список. Для ее определения нам понадобится вспомогательная функция
~evlis~. Она рекурсивно исполняет список, полученный в первом аргументе, применяя к
результатам исполнения CONS, чтобы получить список результатов:

#+NAME: evlis_0
#+BEGIN_SRC lisp
  (defun evlis (lst)
    (cond ((null lst)  nil)
          (t           (cons (myeval (car lst))
                             (evlis (cdr lst))))))
#+END_SRC

Протестируем ~evlis~:

#+NAME: evlis_0_test
#+BEGIN_SRC lisp
  ;; Тесты для EVLIS
  (assert (equal '(3 6 42)
                 (evlis '((+ 1 2) (* 2 3) 42))))
#+END_SRC

Теперь мы можем определить ~list~:

#+NAME: list_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'list)     (evlis (cdr lst)))
#+END_SRC

Протестируем ~list~

#+NAME: list_0_test
#+BEGIN_SRC lisp
  ;; Тесты для LIST
  (assert (equal '(3 6 42)
                 (myeval '(list (+ 1 2) (* 2 3) 42))))
#+END_SRC

* AND

Подобно ~evlis~, ~myand~ рекурсивно вычисляет список, применяя к результатам
~and~. Подобно ~evprogn~, в случае передачи списка из одного аргумента ~myand~
завершается с возвращением результата вычисления ~and~ от одного элемента.

#+NAME: evand_0
#+BEGIN_SRC lisp
  (defun evand (lst)
    (cond ((null lst)        (and))
          ((null (cdr lst))  (and (myeval (car lst))))
          (t                 (and (myeval (car lst))
                                  (evand (cdr lst))))))
#+END_SRC

Протестируем ~evand~:

#+NAME: evand_0_test
#+BEGIN_SRC lisp
  ;; Тесты для EVAND
  (assert (equal (and)           (evand '())))
  (assert (equal (and 1)         (evand '(1))))
  (assert (equal (and nil)       (evand '(nil))))
  (assert (equal (and 1 nil)     (evand '(1 nil ))))
  (assert (equal (and 1 2 nil)   (evand '(1 2 nil))))
  (assert (equal (and 1 2 3)     (evand '(1 2 3))))
#+END_SRC

Теперь мы можем определить ~and~:

#+NAME: and_0
#+BEGIN_SRC lisp
  ((equal (car lst) 'and)      (evand (cdr lst)))
#+END_SRC

Протестируем ~and~:

#+NAME: and_0_test
#+BEGIN_SRC lisp
  ;; Тесты для AND
  (assert (equal (and)                (myeval '(and))))
  (assert (equal (and 1)              (myeval '(and 1))))
  (assert (equal (and nil)            (myeval '(and nil))))
  (assert (equal (and 1 nil)          (myeval '(and 1 nil))))
  (assert (equal (and 1 2 nil)        (myeval '(and 1 2 nil))))
  (assert (equal (and 1 2 3)          (myeval '(and 1 2 3))))
  (assert (equal (and 1 (and 1 2) 3)  (myeval '(and 1 (and 1 2) 3))))
#+END_SRC

