www/lrn/lisp/lisp-0.html

<div id="outline-container-unnumbered-7" class="outline-2">
<h2 id="unnumbered-7">COND</h2>
<div class="outline-text-2" id="text-unnumbered-7">
<p>
Определив IF, мы можем заняться и более сложной управляющей формой - COND. Для ее
реализации потребуется вспомогательная функция, которая будет рекурсивно исполнять
аргументы COND. Назовем ее EVCOND:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evcond_0">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evcond</span> (lst)
  (<span style="color: #af00ff;">cond</span> ((null lst)               nil)
        ((myeval (caar lst))      (myeval (cadar lst)))
        (t                        (evcond (cdr lst)))))
</pre>
</div>

<p>
Она вычисляет левую часть первого из переданных clauses и если оценка вернула T - то
выполняет соответствующую правую часть и возвращается. В противном случае она
рекурсивно вызывает себя, передавая остаток списка clauses
</p>

<p>
Протестируем EVCOND:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evcond_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; ENVCOND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2   (evcond '((t 2)   (t 1)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1   (evcond '((nil 2) (t 1)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil (evcond '((nil 2) (nil 1)))))
</pre>
</div>

<p>
С использованием EVCOND определить COND довольно просто:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="cond_0">((equal (car lst) 'cond)     (evcond (cdr lst)))
</pre>
</div>

<p>
Протестируем правильность работы COND:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="cond_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; COND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                           (() 1)
                           (1 2)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-8" class="outline-2">
<h2 id="unnumbered-8">PROGN</h2>
<div class="outline-text-2" id="text-unnumbered-8">
<p>
Далее нам понадобится <code>progn</code>. Снова будем использовать вспомогательную функцию <code>evprogn</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evprogn_0">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evprogn</span> (lst)
  (<span style="color: #af00ff;">cond</span> ((null lst)        nil)
        ((null (cdr lst))  (myeval (car lst)))
        (t                 (myeval (car lst))
                           (evprogn (cdr lst)))))
</pre>
</div>

<p>
Эта функция завершается с возвращением результата выполнения первого элемента
переданного списка, когда ей передан список из одного элемента. Иначе она вычисляет
первый элемент и рекурсивно вызывает себя от остатка списка.
</p>

<p>
Тест для <code>evprogn</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evprogn_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVPROGN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (evprogn '(1 2))))
</pre>
</div>

<p>
с ее помощью определим PROGN:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="progn_0">((equal (car lst) 'progn)    (evprogn (cdr lst)))
</pre>
</div>

<p>
И проверим:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="progn_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; PROGN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> 1 2 3))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-9" class="outline-2">
<h2 id="unnumbered-9">PRINT</h2>
<div class="outline-text-2" id="text-unnumbered-9">
<p>
Для того, чтобы иметь возможность отладочной печати, определим PRINT:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="print_0">((equal (car lst) 'print)    (print (myeval (cadr lst))))
</pre>
</div>

<p>
Чтобы протестировать <code>print</code> воспользуемся перехватом <code>standatd-output</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="print_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; PRINT</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (print 12))
               (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (myeval '(print 12)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (print 12)
               (myeval '(print 12))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-2">
<h2 id="unnumbered-10">LIST</h2>
<div class="outline-text-2" id="text-unnumbered-10">
<p>
List - это функция, которая вычисляет свои аргументы и формирует из результатов
вычисления список. Для ее определения нам понадобится вспомогательная функция
<code>evlis</code>. Она рекурсивно исполняет список, полученный в первом аргументе, применяя к
результатам исполнения CONS, чтобы получить список результатов:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evlis_0">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (lst)
  (<span style="color: #af00ff;">cond</span> ((null lst)  nil)
        (t           (cons (myeval (car lst))
                           (evlis (cdr lst))))))
</pre>
</div>

<p>
Протестируем <code>evlis</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evlis_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVLIS</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (evlis '((+ 1 2) (* 2 3) 42))))
</pre>
</div>

<p>
Теперь мы можем определить <code>list</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="list_0">((equal (car lst) 'list)     (evlis (cdr lst)))
</pre>
</div>

<p>
Протестируем <code>list</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="list_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LIST</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ 1 2) (* 2 3) 42))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-11" class="outline-2">
<h2 id="unnumbered-11">AND</h2>
<div class="outline-text-2" id="text-unnumbered-11">
<p>
Подобно <code>evlis</code>, <code>myand</code> рекурсивно вычисляет список, применяя к результатам
<code>and</code>. Подобно <code>evprogn</code>, в случае передачи списка из одного аргумента <code>myand</code>
завершается с возвращением результата вычисления <code>and</code> от одного элемента.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evand_0">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evand</span> (lst)
  (<span style="color: #af00ff;">cond</span> ((null lst)        (and))
        ((null (cdr lst))  (and (myeval (car lst))))
        (t                 (and (myeval (car lst))
                                (evand (cdr lst))))))
</pre>
</div>

<p>
Протестируем <code>evand</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evand_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVAND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and)           (evand '())))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1)         (evand '(1))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and nil)       (evand '(nil))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 nil)     (evand '(1 nil ))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 2 nil)   (evand '(1 2 nil))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 2 3)     (evand '(1 2 3))))
</pre>
</div>

<p>
Теперь мы можем определить <code>and</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="and_0">((equal (car lst) 'and)      (evand (cdr lst)))
</pre>
</div>

<p>
Протестируем <code>and</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="and_0_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; AND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and)                (myeval '(and))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1)              (myeval '(and 1))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and nil)            (myeval '(and nil))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 nil)          (myeval '(and 1 nil))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 2 nil)        (myeval '(and 1 2 nil))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 2 3)          (myeval '(and 1 2 3))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 (and 1 2) 3)  (myeval '(and 1 (and 1 2) 3))))
</pre>
</div>
</div>
</div>
